todo_app/app/controllers/todos_controller.rb

  def show
    # TODO: make this find by user_id
    @todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @todo = Todo.find(params[:id])
    puts todo_params
    @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "editor_data" = $1 WHERE "todos"."id" = $2